Repository: MryZhang/wput
Catalog: po/*.po
Languages: uk

source: Resuming in background. Logging output to 'wput-log'.
uk: Поновлюю завантаження в фоновому режимі. Інформація виводиться в 'wput-log'.

source: Unable to open logfile
uk: Неможливо відкрити файл логів

source: Warning:
uk: Попередження:

source: background-mode might not work correctly, if the input-pipe needs to read from stdin (like cat -).
uk: фоновий режим може працювати невірно, якшо канал введення повинен читати дані зі стандарної консолі введення (типу cat -).

source: reading urls from stdin, while running in background-mode is not reliable.
uk: читання url'ів зі стандартної консолі введення, в фоновому режимі, не є надійним.

source: Ignoring request to turn proxy-usage on, since no proxy is configured.
uk: Ігнорую запит на увімкнення проксі, оскільки проксі не зконфігуровано.

source: FINISHED --%s--
uk: ЗАВЕРШЕНО --%s--

source: Transfered %s bytes in %d file at %s
uk: Передано %s байт в %d файлі на швидкості %s

source: Transfered %s bytes in %d files at %s
uk: Передано %s байт в %d файлах на швидкості %s

source: Skipped %d file.
uk: Пропущено %d файл.

source: Skipped %d files.
uk: Пропущено %d файлів.

source: Transmission of %d file failed.
uk: Передача %d файлу невдала.

source: Transmission of %d files failed.
uk: Передача %d файлів невдала.

source: Error:
uk: Помилка:

source: `%s' could not be resolved.
uk: `%s' не може бути визначено.

source: Exiting.
uk: Виходжу.

source: Disabling proxy support.
uk: Забороняю підтримку proxy.

source: netrc file '%s' cannot be read. skipping
uk: netrc файл '%s' не може бути прочитаний. пропускаю

source: password_file '%s' cannot be read. skipping
uk: файл паролів '%s' не вдалося прочитати. пропускаю

source: Warning: You are using a wput password file. This is deprecated! Please consider switch to the widely used netrc-files.
uk: Увага: Ви використовуєте файл паролів для wput. Не радимо цього робити! Розгляньте можливість переходу на широко вживані netrc-файли.

source: Fatal error while opening '%s': %s
uk: Невиправна помилка при відкритті '%s': %s

source: %s#%d: Option '%s' not recognized
uk: %s#%d: Опція '%s' невідома

source: %s#%d: Unknow value '%s' for '%s'
uk: %s#%d: Невідоме значення '%s' для '%s'

source: Option %s should not appear here :|
uk: Опція %s не повинна бути тут :|

source: You supplied an input-pipe. This is only to be used as fallback, if no filename can be found from the URL. This might not be the desired behavour. TODO
uk: Ви вказали канал введення. Проте, він буде використаний лише у випадку, якщо ім"я файлу не зможе бути визначене з URL. Це може бути не та поведінка, яку ви очікуєте. ДОРОБИТИ

source: wput version: %s
uk: wput версія: %s

source: Usage: wput [options] [file]... [url]... url ftp://[username[:password]@]hostname[:port][/[path/][file]] Startup: -V, --version Display the version of wput and exit. -h, --help Print this help-screen
uk: Використання: wput [опції] [файл]... [url]... url ftp://[username[:password]@]hostname[:port][/[path/][file]] Запуск: -V, --version Відображує версію wput та завершує роботу. -h, --help Друкує цю допоміжну інформацію

source: -b, --background go to background after startup
uk: -b, --background переходити у фоновий режим після запуску

source: Logging and input file: -o, --output-file=FILE log messages to FILE -a, --append-output=FILE append log messages to FILE -q, --quiet quiet (no output) -v, --verbose be verbose -d, --debug debug output -nv, --less-verbose be less verbose -i, --input-file=FILE read the URLs from FILE -s, --sort sorts all input URLs by server-ip and path --basename=PATH snip PATH off each file when appendig to an URL -I, --input-pipe=COMMAND take the output of COMMAND as data-source -R, --remove-source-files unlink files upon successful upload
uk: Логування і файл введення: -o, --output-file=ФАЙЛ логувати повідомлення в ФАЙЛ -a, --append-output=ФАЙЛ додавати логи в ФАЙЛ -q, --quiet тихо (не виводити інформацію) -v, --verbose виводити багато інформації -d, --debug виводити відлагоджувальну інформацію -nv, --less-verbose виводити небагато інформації -i, --input-file=ФАЙЛ читати URLи з ФАЙЛ -s, --sort сортувати всі вхідні URLи за адресою сервера і за шляхом --basename=ШЛЯХ відкидати ШЛФХ від кожного файлу, коли приєднуємо до URL -I, --input-pipe=COMMAND брати вивід COMMAND за джерело данних -R, --remove-source-files видалити файли в разі вдалого завантаження

source: FTP-Options: -p, --port-mode no-passive, turn on port mode ftp (def. pasv) -A, --ascii force ASCII mode-transfer -B, --binary force BINARY mode-transfer -m, --chmod change mode of transferred files ([0-7]{3})
uk: FTP-Опції: -p, --port-mode не пасивний режим, увімкнути режим порту для ftp (по замовчуванні - пасивний режим) -A, --ascii використовувати виключно СИМВОЛЬНИЙ режим передачі данних -B, --binary використовувати виключно ДВІЙКОВИЙ режим передачі данних -m, --chmod змінювати режим переданих файлів ([0-7]{3})

source: See wput(1) for more detailed descriptions of the options. Report bugs and suggestions via SourceForge at http://sourceforge.net/tracker/?group_id=141519
uk: Дивись wput(1) для більш детальної інформації про параметри. Надсилайте інформацію про помилки та побажання через SourceForge за адресою http://sourceforge.net/tracker/?group_id=141519

source: Remote file size is bigger than local size. Restarting at 0
uk: Розмір віддаленого файлу більший за розмір локального. Починаю з початку.

source: Remote file size is equal to local size. Restarting at 0
uk: Розмір віддаленого файлу дорівнює розміру локального. Починаю з початку

source: Remote file size is smaller than local size. Restarting at 0.
uk: Розмір віддаленого файлу менший за розмір локального. Починаю з початку.

source: Cannot open local source file to read
uk: Не вдалося відкрити локальний файл-джерело для читання

source: opening the input-pipe failed: %s
uk: помилка відкриття каналу введення: %s

source: Disabling resuming due to ascii-mode transfer
uk: Заборона режиму продовження через текстовий режим передачі

source: local file could not be read: %s
uk: не вдається прочитати локальний файл: %s

source: Error encountered during uploading data
uk: Сталася помилка при завантаженні данних

source: Error encountered during uploading data (%s)
uk: Сталася помилка при завантаженні данних (%s)

source: Removing source file `%s'
uk: Видалення вихідного файлу `%s'

source: No such file or directory: %s
uk: Не знайдено такий файл чи теку: %s

source: RMD of directory %s failed, probably not empty; deleting recursively
uk: RMD теки %s не вдалося, можливо не порожня; видаляємо рекурсивно

source: Failed to change to target directory. Skipping this file/dir.
uk: Не вдалося перейти у вказану теку. Прорускаю цей файл/теку.

source: Directory empty, deletion failed.
uk: Тека порожня, помилка видалення.

source: Failed to change to parent directory. Skipping this file/dir.
uk: Не вдалося перейти в батьківську теку. Пропускаю ці файл/теку.

source: %s deleted.
uk: %s видалений.

source: -- Skipping file: `%s'
uk: -- Пропускаю файл: `%s'

source: --%s-- Deleting file/dir: ftp://%s:xxxxx@%s:%d/%s%s%s
uk: --%s-- Видаляю файл/теку: ftp://%s:xxxxx@%s:%d/%s%s%s

source: Skipping all files from this account...
uk: Пропускаю всі файли цього облікового запису...

source: Unable to set transfer mode. Assuming binary
uk: Не вдається встановити режим передачі. Припускаю, що бінарний

source: Skipping this file due to resume/upload/skip rules.
uk: Пропускаю цей файл через відповідне правило поновлення, завантаження чи пропуску.

source: -- Skipping file: %s
uk: -- Пропускаю файл: %s

source: Send Failed (%s)
uk: Помилка відправки (%s)

source: Delete Failed.
uk: Помилка видалення.

source: Skipping this file
uk: Пропускаю цей файл

source: Assuming the proxy to do the task.
uk: Сподіваюсь на проксі для виконання завдання.

source: Skipping this URL.
uk: Пропускаю цей URL.

source: URL: # or ? functions unimplemented. Assuming they are part of the filename.
uk: URL: опції # чи ? не підтримуються. Розглядаємо знаки як частину імені файла.

source: client: can't open stream socket
uk: клієнт: не вдалося відкрити потоковий сокет

source: server: can't open new socket
uk: сервер: не вдалося відкрити новий сокет

source: server: can't bind local address
uk: сервер: неможливо прив'язатись до локальної адреси

source: error accepting the incoming connection
uk: помилка прийняття з'єднання ззовні

source: TLS handshake failed
uk: TLS "рукостискання" не вдалося

source: Receive-Warning: read() timed out. Read '%s' so far.
uk: Проблема прийому: виник таймаут функції read(). Покищо прочитано '%s'.

source: Receive-Error: read() failed. Read '%s' so far. (errno: %s (%d))
uk: Попилка прийому: помилка функції read(). Покищо прочитано '%s'. (помилка: %s (%d))

source: recv() timed out. No data received
uk: recv() таймаут. Дані не отримано

source: failed.
uk: не вдало.

source: Connection to proxy cannot be established.
uk: З'єднання з проксі не може бути виконано.

source: read() failed: %d (%d: %s)
uk: помилка функції read(): %d (%d: %s)

source: Proxy version mismatch (%d)
uk: Версії проксі не співпадають (%d)

source: Proxy authentication failure
uk: Не вдається виконати авторизацію проксі

source: Proxy method mismatch (%d)
uk: Методи проксі не співпадають (%d)

source: Proxy discarded listen-request. Error-Code: %d
uk: Проксі відкидає запит на прослуховування. Код помилки: %d

source: Disabling listen-tries for proxy
uk: Забороняю спроби прослуховування для проксі

source: Proxy is listening on %s:%d for incoming connections
uk: Проксі прослуховує %s:%d на предмет вхідних з'єднань

source: Proxy encountered an error while accepting. Error-Code: %d
uk: Помилка проксі виникла під час підтвердження з'єднання. Код помилки: %d

source: Using SOCKS5-Proxy %s:%d...
uk: Використовую SOCKS5-Проксі %s:%d...

source: Proxy connection established.
uk: Встановлено з'єднання з проксі.

source: Connection through proxy failed. Error-code: %d
uk: Невдача з'єднання через проксі. Код помилки: %d

source: Connection could not be established. Proxy states '%s'
uk: Неможливо встановити з'єднання. Стан проксі '%s'

source: Receive-Error: Connection broke down.
uk: Помилка прийому: З'єднання розірване.

source: Receive-Error: Invalid FTP-answer (%d bytes): %s
uk: Помилка прийому: Невірна відповідь FTP (%d байтів): %s

source: Reconnecting to be sure, nothing went wrong
uk: Повторне з'єднання для впевненості, що все гаразд

source: Connecting to %s:%d...
uk: Приєднуємось до %s:%d...

source: failed!
uk: помилка!

source: connected
uk: з'єднано

source: Connection failed (%s)
uk: Помилка з'єднання (%s)

source: TLS encryption is explicitly required, but could not be established.
uk: TLS кодування явно вимагається, але не може бути забезпечено.

source: Logging in as %s ...
uk: Реєструюсь як %s ...

source: remote server requires a password, but none set. Using an empty one.
uk: віддалений сервер вимагає пароль, але він не вказаний. Використовуємо порожній пароль.

source: Server requires account login, which is not supported.
uk: Сервер вимагає реєстрацію облікового запису, така можливість не підтримується.

source: Login-Sequence failed (%s)
uk: Невдала реєстрація (%s)

source: Logged in!
uk: Реєстрація вдалась!

source: failed (%s).
uk: помилка (%s).

source: encrypted!
uk: закодовано!

source: Setting data protection level to private ...
uk: Втановлюю приватний рівень захисту данних ...

source: done.
uk: завершено.

source: done (%s).
uk: завершено (%s).

source: Connection cancelled (%s)
uk: З'єднання відмінено (%s)

source: done (modified on %d.%d.%d at %d:%d:%d)
uk: завершено (змінено %d.%d.%d at %d:%d:%d)

source: done (%s bytes)
uk: завершено (%s байтів)

source: failed (%s).
uk: помилка (%s).

source: done.
uk: завершено.

source: Cannot initiate data-connection (%s)
uk: Не можу встановити зв'язок для передачі данних (%s)

source: listing directory failed (%s)
uk: помилка перегляду теки (%s)

source: failed. Server seems not to support resuming. Restarting at 0
uk: невдача. Схоже що сервер не підтримує поновлення завантаження. Рестартую з 0

source: [not done, but should be allright]
uk: [не виконано, але все має бути гаразд]

source: failed (%s). (disabling resuming)
uk: невдача (%s). (забороняю докачування)

source: Trying to switch PORT/PASV mode
uk: Пробую перемкнути PORT/PASV режим

source: failed (%d %s). (skipping)
uk: невдача (%d %s). (пропускаю)

source: failed (%s)
uk: невдача (%s)

source: connection failed.
uk: з'єднання не вдалося.

source: Trying to listen on proxy server...
uk: Намагаюсь прослуховувати через проксі сервер...

source: failed. Falling back to listen locally
uk: невдача. Повертаюсь до локального прослуховування

source: Unless FXP is enabled remotely, your control-connection should be from the same IP-address, as your PORT bind-request. So you should consider PASV-mode or reconnect without a proxy.
uk: Крім випадків, коли FXP дозволений на віддаленому сервері, ваше керуюче з'єднання повинне бути з тієї ж IP адреси, що і PORT запит. Тож розгляньте можливість використовувати PASV режим або перепід'єднайтесь без проксі.

source: Using port-mode. Unable to use the http-proxy for this connection
uk: Використувую port-режим. Неможливо застосувати http-проксі для цього з'єднання

source: Cannot determine local IP address
uk: Не вдалося визначити локальну IP адресу

source: parse-error in escaped character: %c is not a hexadecimal character
uk: помилка розпізнавання спеціального символа: %c це не шіснадцятковий символ

source: Waiting %d seconds...
uk: Чекаю %d секунд...

source: No http-header found. Assuming socks-proxy $host:$port for `%s'
uk: Не знайдено http-заголовок. Очевидно це socks-proxy $host:$port для `%s'

source: No port specified. Assuming default port %d.
uk: Не вказано порт. Використовую значення %d.

source: Error: Please specify a url first.
uk: Помилка: Будь ласка, вкажіть спочатку url.

source: Error encountered but ignored during stat of `%s'.
uk: Виявлена помилка (але знехтую нею) під час команди stat для `%s'.

source: Error encountered but ignored during opendir of `%s'.
uk: Виявлена помилка (але знехтую нею) під час команди opendir для `%s'.

source: Seems as though there are two equivalent entries to upload.
uk: Схоже я маю два однакові вхідні файли для завантаження.

source: the url `%s' could not be parsed
uk: url `%s' не вдалось розібрати

source: Neither a remote location nor a local filename has been specified. Assuming you want to upload the current working directory to the remote server.
uk: Не було вказано ні віддалену адресу ні ім'я локального файлу. Припускаю, що ви хочете заватнажити поточну теку на віддалений сервер.

source: No local file specified and no file found from URL. Assuming the current working directory is to be uploaded to the remote server.
uk: Локальний файл не заданий і не вдалось виділити файл з URLу. Припускаю, що всю робочу теку треба завантажити на віддалений сервер.

source: File `%s' does not exist. Assuming you supply its input using the -I flag.
uk: Файл `%s' не існує. Припустаю ви вказали його вхідні дані використовуючи параметр -I.

source: File `%s' does not exist. Don't know what to do about this URL.
uk: Файл `%s' не існує. Не знаю що робити із отриманим URLом.

source: Length: %s
uk: Довжина: %s

source: [%s to go]
uk: [%s залишилось]

source: %* [ skipped %dK ] %* %dK
uk: %* [ пропущено %dK ] %* %dK

source: Unsupported listing type, trying Unix listing parser.
uk: Тип лістінгу невідомий, спроба розібрати в стилі лістингу Unix.

source: Index of /%s on %s:%d
uk: Лістинг каталогу /%s на %s:%d

source: time unknown
uk: час невідомий

source: File
uk: Файл

source: Directory
uk: Тека

source: Link
uk: Посилання

source: Not sure
uk: Не впевнений

source: (%s bytes)
uk: (%s байт)
